Paciente8159/uCNC/uCNC/src/hal/mcus/esp32c/mcumap_esp32_cx.h
#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER
#define ONESHOT_TIMER_TG (ONESHOT_TIMER & 0x01)
#define ONESHOT_TIMER_IDX ((ONESHOT_TIMER >> 1) & 0x01)
#endif

// SPI
#if (defined(SPI_CLK) && defined(SPI_SDI) && defined(SPI_SDO))
#define MCU_HAS_SPI
#ifndef SPI_PORT
#define SPI_PORT 2
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
#endif

// SPI2
#if (defined(SPI2_CLK) && defined(SPI2_SDI) && defined(SPI2_SDO))
#define MCU_HAS_SPI2
#ifndef SPI2_PORT
#define SPI2_PORT 2
#endif
#ifndef SPI2_MODE
#define SPI2_MODE 0
#endif
#ifndef SPI2_FREQ
#define SPI2_FREQ 1000000UL
#endif
#endif

// Helper macros
#define __helper_ex__(left, mid, right) (left##mid##right)
#define __helper__(left, mid, right) (__helper_ex__(left, mid, right))
#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))
#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif
#ifndef I2C_PORT
#define I2C_PORT 0
#endif
#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif

#if (I2C_PORT == 0)
#define I2C_REG Wire
#else
#define I2C_REG __helper__(Wire, I2C_PORT, )
#endif
#endif

#ifndef IC74HC595_I2S_PORT
#define IC74HC595_I2S_PORT 0
#endif
#ifdef IC74HC595_CUSTOM_SHIFT_IO
#ifdef IC74HC595_COUNT
#undef IC74HC595_COUNT
#endif
#define IC74HC595_COUNT 4
#define I2SREG __helper__(I2S, IC74HC595_I2S_PORT, )

	// custom pin operations for 74HS595
	extern volatile uint32_t ic74hc595_i2s_pins;
#define ic74hc595_pin_offset(pin) (__indirect__(pin, IO_OFFSET))
#define ic74hc595_pin_mask(pin) (uint32_t)(1UL << ic74hc595_pin_offset(pin))
#define ic74hc595_set_pin(pin) __atomic_fetch_or((uint32_t *)&ic74hc595_i2s_pins, ic74hc595_pin_mask(pin), __ATOMIC_RELAXED)
#define ic74hc595_clear_pin(pin) __atomic_fetch_and((uint32_t *)&ic74hc595_i2s_pins, ~(ic74hc595_pin_mask(pin)), __ATOMIC_RELAXED)
#define ic74hc595_toggle_pin(pin) __atomic_fetch_xor((uint32_t *)&ic74hc595_i2s_pins, ic74hc595_pin_mask(pin), __ATOMIC_RELAXED)
#define ic74hc595_get_pin(pin) (__atomic_load_n((uint32_t *)&ic74hc595_i2s_pins, __ATOMIC_RELAXED) & ic74hc595_pin_mask(pin))
#endif

#define mcu_config_output(X)                                                      \
	{                                                                               \
		gpio_pad_select_gpio(__indirect__(X, BIT));                                   \
		gpio_set_direction((gpio_num_t)__indirect__(X, BIT), GPIO_MODE_INPUT_OUTPUT); \
	}
#define mcu_config_input(X)                                                \
	{                                                                        \
		gpio_pad_select_gpio(__indirect__(X, BIT));                            \
		gpio_set_direction((gpio_num_t)__indirect__(X, BIT), GPIO_MODE_INPUT); \
		gpio_pulldown_dis((gpio_num_t)__indirect__(X, BIT));                   \
		gpio_pullup_dis((gpio_num_t)__indirect__(X, BIT));                     \
	}
#define mcu_config_analog(X)                                                      \
	{                                                                               \
		mcu_config_input(X);                                                          \
		adc1_config_width(ADC_WIDTH_MAX - 1);                                         \
		adc1_config_channel_atten(__indirect__(X, ADC_CHANNEL), (ADC_ATTEN_MAX - 1)); \
	}
#define mcu_config_pullup(X)                                               \
	{                                                                        \
		gpio_pad_select_gpio(__indirect__(X, BIT));                            \
		gpio_set_direction((gpio_num_t)__indirect__(X, BIT), GPIO_MODE_INPUT); \
		gpio_pulldown_dis((gpio_num_t)__indirect__(X, BIT));                   \
		gpio_pullup_en((gpio_num_t)__indirect__(X, BIT));                      \
	}
	extern void mcu_gpio_isr(void *);
#define mcu_config_input_isr(X)                                                                              \
	{                                                                                                          \
		gpio_set_intr_type((gpio_num_t)(__indirect__(X, BIT)), GPIO_INTR_ANYEDGE);                               \
		gpio_isr_handler_add((gpio_num_t)(__indirect__(X, BIT)), mcu_gpio_isr, (void *)__indirect__(X, ISRVAR)); \
	}

// #define mcu_get_input(X) gpio_get_level((gpio_num_t)__indirect__(X, BIT))
#define mcu_get_input(X)                                \
	({                                                    \
		uint32_t inputs = (__indirect__(X, INREG)->IN);     \
		((inputs >> (0x1F & __indirect__(X, BIT))) & 0x01); \
	})
#define mcu_get_output(X) ((__indirect__(X, OUTREG)->OUT) & (1UL << (0x1F & __indirect__(X, BIT))))
#define mcu_set_output(X)                                                     \
	{                                                                           \
		__indirect__(X, OUTREG)->OUTSET = (1UL << (0x1F & __indirect__(X, BIT))); \
	}
#define mcu_clear_output(X)                                                   \
	{                                                                           \
		__indirect__(X, OUTREG)->OUTCLR = (1UL << (0x1F & __indirect__(X, BIT))); \
	}
#define mcu_toggle_output(X)                                                \
	{                                                                         \
		__indirect__(X, OUTREG)->OUT ^= (1UL << (0x1F & __indirect__(X, BIT))); \
	}

#define mcu_config_pwm(X, Y)                          \
	{                                                   \
		ledc_timer_config_t pwmtimer = {0};               \
		pwmtimer.speed_mode = __indirect__(X, SPEEDMODE); \
		pwmtimer.timer_num = __indirect__(X, TIMER);      \
		pwmtimer.duty_resolution = LEDC_TIMER_8_BIT;      \
		pwmtimer.freq_hz = Y;                             \
		pwmtimer.clk_cfg = LEDC_AUTO_CLK;                 \
		ledc_timer_config(&pwmtimer);                     \
		ledc_channel_config_t pwm = {0};                  \
		pwm.channel = __indirect__(X, CHANNEL);           \
		pwm.duty = 0;                                     \
		pwm.gpio_num = __indirect__(X, BIT);              \
		pwm.hpoint = 0;                                   \
		pwm.speed_mode = __indirect__(X, SPEEDMODE);      \
		pwm.timer_sel = __indirect__(X, TIMER);           \
		ledc_channel_config(&pwm);                        \
	}

