Paciente8159/uCNC/uCNC/src/hal/mcus/esp32c/mcumap_esp32_cx.h
#define mcu_set_pwm(X, Y)                                                       \
	{                                                                             \
		ledc_set_duty(__indirect__(X, SPEEDMODE), __indirect__(X, LEDCCHANNEL), Y); \
		ledc_update_duty(__indirect__(X, SPEEDMODE), __indirect__(X, LEDCCHANNEL)); \
	}
#define mcu_get_pwm(X) ledc_get_duty(__indirect__(X, SPEEDMODE), __indirect__(X, LEDCCHANNEL))
#define mcu_get_analog(X) (adc1_get_raw(__indirect__(X, ADC_CHANNEL)) >> (ADC_WIDTH_MAX - 2))

	extern void esp32_delay_us(uint16_t delay);
#define mcu_delay_us(X) esp32_delay_us(X)

#include "xtensa/core-macros.h"
#define mcu_delay_cycles(X)                          \
	{                                                  \
		uint32_t x = XTHAL_GET_CCOUNT();                 \
		while (X > (((uint32_t)XTHAL_GET_CCOUNT()) - x)) \
			;                                              \
	}

#define __FREERTOS_MUTEX_TAKE__(mutex, timeout) ((xPortInIsrContext()) ? (xSemaphoreTakeFromISR(mutex, NULL)) : (xSemaphoreTake(mutex, timeout)))
#define __FREERTOS_MUTEX_GIVE__(mutex) ((xPortInIsrContext()) ? (xSemaphoreGiveFromISR(mutex, NULL)) : (xSemaphoreGive(mutex)))

#define MUTEX_CLEANUP(name)                       \
	static void name##_mutex_cleanup(uint8_t *m)    \
	{                                               \
		if (*m /*can unlock*/)                        \
		{                                             \
			__FREERTOS_MUTEX_GIVE__(name##_mutex_lock); \
		}                                             \
	}
#define DECL_MUTEX(name)                             \
	static SemaphoreHandle_t name##_mutex_lock = NULL; \
	MUTEX_CLEANUP(name)

#define MUTEX_INIT(name)                         \
	if (name##_mutex_lock == NULL)                 \
	{                                              \
		name##_mutex_lock = xSemaphoreCreateMutex(); \
	}                                              \
	uint8_t __attribute__((__cleanup__(name##_mutex_cleanup))) name##_mutex_temp = 0
#define MUTEX_RELEASE(name)            \
	if (name##_mutex_temp)               \
	{                                    \
		name##_mutex_temp = 0;             \
		__FREERTOS_MUTEX_GIVE__(name##_mutex_lock); \
	}
#define MUTEX_TAKE(name)                                                                             \
	name##_mutex_temp = (__FREERTOS_MUTEX_TAKE__(name##_mutex_lock, portMAX_DELAY) == pdTRUE) ? 1 : 0; \
	if (name##_mutex_temp)
#define MUTEX_WAIT(name, timeout_ms)                                                                                     \
	name##_mutex_temp = (__FREERTOS_MUTEX_TAKE__(name##_mutex_lock, (timeout_us / portTICK_PERIOD_MS)) == pdTRUE) ? 1 : 0; \
	if (name##_mutex_temp)

#ifdef __cplusplus
}
#endif

#endif
